In [62]:
%pip install chardet

Requirement already satisfied: chardet in c:\users\river\anaconda3\envs\ml\lib\site-packages (5.1.0)Note: you may need to restart the kernel to use updated packages.

In [63]:
import pandas as pd

In [64]:
import openpyxl

In [65]:


ny_real = pd.read_excel('../data/Table.xlsx')

In [66]:
ny_real

,Area,Borough,Median Asking Price,Median Asking Price Yoy % Change,Median Asking Rent,Median Asking Rent Yoy % Change,Median Recorded Sales Price,Median Recorded Sales Price Yoy % Change
0,All Downtown,Manhattan,$2.195.000,0.219,$4.500,0.452,$1.483.500,0.067
1,All Midtown,Manhattan,$1.225.000,0.225,$4.350,0.500,$713.500,-0.002
2,All Upper East Side,Manhattan,$1.675.000,0.117,$3.400,0.388,$1.122.250,0.207
3,All Upper Manhattan,Manhattan,$699.000,0.000,$2.399,0.091,$659.000,-0.060
4,All Upper West Side,Manhattan,$1.837.500,0.317,$4.000,0.431,$1.372.500,0.168
...,...,...,...,...,...,...,...,...
148,Whitestone,Queens,$649.444,-0.236,NaN,-0.167,$918.000,0.080
149,Williamsburg,Brooklyn,$1.323.250,-0.020,$3.795,0.365,$1.151.500,0.163
150,Windsor Terrace,Brooklyn,$980.000,0.154,$2.894,0.052,NaN,-0.143
151,Woodhaven,Queens,$724.500,0.156,$2.250,0.125,NaN,0.021
152,Woodside,Queens,$547.500,0.311,$1.925,0.085,NaN,-0.370

In [67]:
ny_real.columns

Index(['Area', 'Borough', 'Median Asking Price',
       'Median Asking Price Yoy %  Change', 'Median Asking Rent',
       'Median Asking Rent Yoy %  Change', 'Median Recorded Sales Price',
       'Median Recorded Sales Price Yoy %  Change'],
      dtype='object')

In [68]:
ny_real.Borough.unique()

array(['Manhattan', 'Queens', 'Brooklyn'], dtype=object)

In [69]:
# Rellenar los valores nulos de la columna "b" con los valores de la columna "a"
ny_real['Median Recorded Sales Price'] = ny_real['Median Recorded Sales Price'].fillna(ny_real['Median Asking Price'])

In [70]:
ny_real = ny_real.drop(columns=['Area', 'Median Asking Price Yoy %  Change', 'Median Asking Rent Yoy %  Change', 'Median Asking Price','Median Recorded Sales Price Yoy %  Change'])

In [71]:
ny_real = ny_real.dropna()

In [72]:
ny_real

       Borough Median Asking Rent Median Recorded Sales Price
0    Manhattan             $4.500                  $1.483.500
1    Manhattan             $4.350                    $713.500
2    Manhattan             $3.400                  $1.122.250
3    Manhattan             $2.399                    $659.000
4    Manhattan             $4.000                  $1.372.500
..         ...                ...                         ...
147  Manhattan             $4.495                  $1.341.906
149   Brooklyn             $3.795                  $1.151.500
150   Brooklyn             $2.894                    $980.000
151     Queens             $2.250                    $724.500
152     Queens             $1.925                    $547.500

[114 rows x 3 columns]

In [73]:
ny_real['Median Asking Rent'] = ny_real['Median Asking Rent'].str.replace('$', '').str.replace('.', '').str.replace(',', '.').astype(int)
ny_real['Median Recorded Sales Price'] = ny_real['Median Recorded Sales Price'].str.replace('$', '').str.replace('.', '').str.replace(',', '.').astype(int)

C:\Users\river\AppData\Local\Temp\ipykernel_23520\2491306272.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  ny_real['Median Asking Rent'] = ny_real['Median Asking Rent'].str.replace('$', '').str.replace('.', '').str.replace(',', '.').astype(int)
C:\Users\river\AppData\Local\Temp\ipykernel_23520\2491306272.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  ny_real['Median Recorded Sales Price'] = ny_real['Median Recorded Sales Price'].str.replace('$', '').str.replace('.', '').str.replace(',', '.').astype(int)

In [74]:
ny_real

       Borough  Median Asking Rent  Median Recorded Sales Price
0    Manhattan                4500                      1483500
1    Manhattan                4350                       713500
2    Manhattan                3400                      1122250
3    Manhattan                2399                       659000
4    Manhattan                4000                      1372500
..         ...                 ...                          ...
147  Manhattan                4495                      1341906
149   Brooklyn                3795                      1151500
150   Brooklyn                2894                       980000
151     Queens                2250                       724500
152     Queens                1925                       547500

[114 rows x 3 columns]

In [75]:
ny_real=ny_real.groupby('Borough').sum().reset_index()
ny_real

     Borough  Median Asking Rent  Median Recorded Sales Price
0   Brooklyn              127673                     54440421
1  Manhattan              141565                     51650743
2     Queens               69831                     20755520